Revit 2023 API
AnalysisMode Enumeration
 This enum is used to define the Energy Analysis Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public enum AnalysisMode
Visual Basic
Public Enumeration AnalysisMode
Visual C++
public enum class AnalysisMode
Members
Member name | Description
BuildingElements |  Energy Analysis Model based on building elements.
ConceptualMasses |  Energy Analysis Model based on conceptual masses. This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'ConceptualMassesAndBuildingElements' option instead.
ConceptualMassesAndBuildingElements |  Energy Analysis Model based on conceptual masses and building elements.
RoomsOrSpaces |  Energy Analysis Model based on spatial elements. This mode uses volumes based on rooms or spaces defined in the building model.
See Also
Autodesk.Revit.DB.Analysis Namespace